# globals
globals_webApplicationText = Aplicaci\u00f3n Web
globals_androidApplicationText = Aplicaci\u00f3n Android
globals_mimeTypePDF = application/pdf

# mainTemplate.xhtml
mainTemplate_pageTitle = Aplicaci\u00f3n Web OMR Grader 2.0

# header.xhtml
header_headerTitle = OMR Grader 2.0
header_menuItem_home_value = Inicio
header_subMenu_about_label = Acerca de
header_menuItem_aboutUs_value = Nosotros
header_menuItem_aboutApplication_value = La Aplicaci\u00f3n
header_menuItem_aboutProject_value = El Proyecto
header_menuItem_userDocumentation_value = Manual de Usuario
header_menuItem_examTemplate_value = Plantilla de Evaluaci\u00f3n
header_menuItem_acknowledgments_value = Agradecimientos

# footer.xhtml
footer_emailAddressText = calificacionexamen@gmail.com
footer_universityAndSubjectText = Universidad de Antioquia | Proyecto Integrador II
footer_placeAndCopyrightAndYearText = Medell\u00edn - Colombia | Todos los derechos reservados \u00a9 2015

# index.xhtml
index_media_youtubeVideoAboutProject_value = https://www.youtube.com/v/Nld8XGwuXbs

# aboutUs.xhtml
aboutUs_headerTitle = Integrantes
aboutUs_outputText_introductionText_value = En esta secci\u00f3n se puede encontrar informaci\u00f3n personal y de contacto de todas aquellas personas que estuvieron siempre involucradas, durante todo el ciclo de vida de este proyecto; e igualmente importante, el rol desempe\u00f1ado por cada una de estas personas.
aboutUs_column_fullNameTableHeader = Nombre Completo
aboutUs_column_emailAddressTableHeader = Correo Electr\u00f3nico
aboutUs_column_roleInTheProjectTableHeader = Rol en el Proyecto
aboutUs_column_occupationTableHeader = Ocupaci\u00f3n
aboutUs_outputText_AGSFullName_value = Andersson Garc\u00eda Sotelo
aboutUs_outputText_AGSEmailAddress_value = anderssongarciasotelo@gmail.com
aboutUs_outputText_AGSRoleInTheProject_value = Desarrollador
aboutUs_outputText_AGSOccupation_value = Estudiante de Ingenier\u00eda de Sistemas | Universidad de Antioquia
aboutUs_outputText_MAORFullName_value = Miguel \u00c1ngel Ossar Ruiz
aboutUs_outputText_MAOREmailAddress_value = miguelcold8@gmail.com
aboutUs_outputText_MAORRoleInTheProject_value = Gestor de Proyecto
aboutUs_outputText_MAOROccupation_value = Estudiante de Ingenier\u00eda de Sistemas | Universidad de Antioquia
aboutUs_outputText_NPPFullName_value = Neiber Padierna P\u00e9rez
aboutUs_outputText_NPPEmailAddress_value = padierna0423@gmail.com
aboutUs_outputText_NPPRoleInTheProject_value = Desarrollador
aboutUs_outputText_NPPOccupation_value = Estudiante de Ingenier\u00eda de Sistemas | Universidad de Antioquia
aboutUs_outputText_JFFHFullName_value = Juan Fernando Franco Higuita
aboutUs_outputText_JFFHEmailAddress_value = juanferfranco@gmail.com
aboutUs_outputText_JFFHRoleInTheProject_value = Coordinador del Proyecto
aboutUs_outputText_JFFHOccupation_value = Profesor de Planta de Ingenier\u00eda | Universidad Pontificia Bolivariana

# aboutApplication.xhtml
aboutApplication_headerTitle = Aplicaciones
aboutApplication_outputText_introduction_value = En esta secci\u00f3n se listan y se detallan brevemente las tecnolog\u00edas, entornos de desarrollo (<i>Integrated Development Environment</i>), complementos y otros elementos que fueron utilizados para la construcci\u00f3n de las aplicaciones tanto Android como Web.
aboutApplication_outputText_introductionWebApplication_value = A continuaci\u00f3n se listan las Tecnolog\u00edas y Frameworks importantes y fundamentales que ayudaron a construir las bases para la implementaci\u00f3n de la aplicaci\u00f3n Web.
aboutApplication_facetHeaderTechnologiesText = Tecnolog\u00edas
aboutApplication_tab_javaJDKNameWAT_title = Java JDK 1.7.0_60
aboutApplication_outputText_javaJDKDescriptionWAT_value = Es un Software libre que provee herramientas de desarrollo para la creaci\u00f3n de diversos programas en el lenguaje de programaci\u00f3n Java. Entre los programas que este Software incluye se encuentran un visor de Applets, un compilador, un int\u00e9rprete y un generador de documentaci\u00f3n. Este Software fue usado como base para construir la aplicaci\u00f3n OMR Grader, lo que quiere decir que est\u00e1 basada en Java, el cual fue escogido gracias a su versatilidad, interoperabilidad y usabilidad.
aboutApplication_tab_netbeansIDENameWAT_title = NetBeans IDE 7.3
aboutApplication_outputText_netbeansIDEDescriptionWAT_value = Es un Entorno de Desarrollo Integrado (IDE) libre, para desarrollar programas en diferentes lenguajes de programaci\u00f3n como lo son Java, C, C++ y PHP, tanto para aplicaciones de escritorio como para desarrollo Web. Netbeans est\u00e1 desarrollado en Java lo que le otorga interoperabilidad e independencia sobre los sistemas operativos al ejecutarse en la JVM (Java Virtual Machine), lo que permite que este IDE pueda ser instalado en diversos sistemas operativos.
aboutApplication_tab_javaMailNameWAT_title = Java Mail 1.5.2
aboutApplication_outputText_javaMailDescriptionWAT_value = Es una Interfaz de Programaci\u00f3n de Aplicaciones (API) libre, esta proporciona un marco independiente de la plataforma y de protocolos para construir aplicaciones que puedan hacer uso de correo electr\u00f3nico y mensajer\u00eda instant\u00e1nea.
aboutApplication_tab_log4jNameWAT_title = Log4j 1.2.17
aboutApplication_outputText_log4jDescriptionWAT_value = Es un proyecto de Apache Software Foundation que corresponde a una utilidad compuesta por un registro basada en el lenguaje de programaci\u00f3n de alto nivel Java. Log4j es uno de varios marcos para llevar registros o logging en Java. Se ha elegido Log4j como marco para mantener el seguimiento sobre cada error que pueda presentarse mientras la aplicaci\u00f3n est\u00e1 funcionando, de manera que la informaci\u00f3n sobre cada error sea almacenada en dicho marco con el fin de evaluar y corregir los posibles errores dentro del sistema en un futuro.
aboutApplication_tab_primefacesThemesNameWAT_title = PrimeFaces Themes 1.0.10
aboutApplication_outputText_primefacesThemesDescriptionWAT_value = Es una librer\u00eda del framework PrimeFaces, la cual tiene integrada un marco de temas diferentes basados en CSS, entre los cuales existen 38 libres predise\u00f1ados, sin embargo tambi\u00e9n es posible comprar los temas ELITE o crear los temas propios. Esta librer\u00eda es muy f\u00e1cil de usar e implementar en aplicaciones Web que hacen uso de JavaServer Faces con su framework Primefaces.
aboutApplication_tab_glassfishServerNameWAT_title = GlassFish Server 3.1.2
aboutApplication_outputText_glassfishServerDescriptionWAT_value = Es un servidor de aplicaciones, el cual ejecuta, contiene o despliega ciertas aplicaciones. Generalmente este tipo de Software facilita servicios de aplicaciones a las computadoras clientes, gestiona los permisos en las aplicaciones, las funciones de l\u00f3gica del negocio y acceso o gesti\u00f3n de datos o a recursos que estas requieran.
aboutApplication_tab_mysqlServerNameWAT_title = MySQL Server 5.5.37
aboutApplication_outputText_mysqlServerDescriptionWAT_value = Es el segundo sistema de gesti\u00f3n de bases de datos relacionales (RDBMS) m\u00e1s utilizado a nivel mundial de c\u00f3digo abierto. MySQL es un proyecto bajo licencia p\u00fablica general GNU, ahora propiedad de Oracle Corporation. Este sistema de gesti\u00f3n es altamente usado en aplicaciones Web permitiendo almacenar datos que deben ser persistentes en cada tipo de aplicaci\u00f3n, de esta manera permite la administraci\u00f3n de todos los datos almacenados, optimizando cada proceso de gesti\u00f3n seg\u00fan se requiera, adem\u00e1s, que garantiza las operaciones A.C.I.D., las cuales son: Atomicidad, Consistencia, Integridad y Durabilidad.
aboutApplication_tab_mysqlWorkbenchNameWAT_title = MySQL Workbench 5.2.47
aboutApplication_outputText_mysqlWorkbenchDescriptionWAT_value = Es una herramienta de Software para realizar dise\u00f1os visuales de bases de datos relacionales, adem\u00e1s de esto integra el desarrollo SQL, administraci\u00f3n de la base de datos, creaci\u00f3n y mantenimiento. MySQL Workbench es el \u00fanico entorno integrado de desarrollo para las bases de datos MySQL. Esta herramienta ha sido utilizada en primer lugar para realizar el dise\u00f1o de la base de datos, adem\u00e1s de permitir la administraci\u00f3n de dicha base de datos, de manera que mediante este Software se puede hacer seguimiento y mantenimiento a la base de datos utilizada.
aboutApplication_tab_linuxUbuntuNameWAT_title = Linux Ubuntu 13.10 64-bits
aboutApplication_outputText_linuxUbuntuDescriptionWAT_value = Es un Sistema Operativo basado en Linux y que es distribuido como Software libre. Este Sistema Operativo est\u00e1 orientado al usuario promedio, con fuerte enfoque en la facilidad de uso y en mejorar la experiencia de este. Este Sistema Operativo ha sido usado para ejecutar todo el sistema completamente, permitiendo de esta manera mantener el Software operando en todo momento de ser necesario, junto a su base de datos y dem\u00e1s componentes. Linux Ubuntu fue seleccionado gracias a que se mantiene de forma libre y gratuita, adem\u00e1s, es posible aprovechar los desarrollos por parte de la comunidad para mejorar los componentes de s\u00ed mismo.
aboutApplication_facetHeaderFrameworksText = Frameworks
aboutApplication_tab_springMVCNameWAF_title = Spring MVC Framework 4.0.0
aboutApplication_outputText_springMVCDescriptionWAF_value = Spring es el framework para desarrollo de aplicaciones m\u00e1s famoso para Java empresarial. Es usado ampliamente para crear c\u00f3digo de alto rendimiento, f\u00e1cil de probar y reusable. El n\u00facleo del Spring Framework puede ser usado en el desarrollo de cualquier aplicaci\u00f3n Java, pero hay extensiones para construir aplicaciones Web en la cima de la plataforma Java EE. Este framework se centra en hacer m\u00e1s f\u00e1cil el desarrollo J2EE para usar y promover el uso de buenas pr\u00e1cticas de programaci\u00f3n que permitan un modelo de programaci\u00f3n basado en POJO\u2019s.
aboutApplication_tab_hibernateOMRNameWAF_title = Hibernate ORM 4.2.3
aboutApplication_outputText_hibernateOMRDescriptionWAF_value = Hibernate es un servicio de alto rendimiento de persistencia Objeto/Relacional y de consultas, el cual no solo cuida del mapeo desde clases Java a las tablas en una base de datos (y desde tipo de datos Java a tipos de datos SQL), sino tambi\u00e9n proporciona consultas de datos y facilidades de recuperaci\u00f3n. Hibernate busca solucionar el problema de la diferencia entre los dos modelos de datos coexistentes en una aplicaci\u00f3n. Con esta informaci\u00f3n Hibernate le permite a la aplicaci\u00f3n manipular los datos en la base de datos operando sobre objetos, con todas las caracter\u00edsticas de la programaci\u00f3n orientada a objetos. Hibernate fue utilizado para la construcci\u00f3n de la aplicaci\u00f3n porque genera las sentencias SQL y libera al desarrollador del manejo manual de los datos que resultan de la ejecuci\u00f3n de dichas sentencias, manteniendo la portabilidad entre todos los motores de bases de datos con un ligero incremento en el tiempo de ejecuci\u00f3n.
aboutApplication_tab_jsfNameWAF_title = JavaServer Faces (PrimeFaces 5.1)
aboutApplication_outputText_jsfDescriptionWAF_value = Es un framework de aplicaciones Web basado en Java destinado a simplificar la integraci\u00f3n del desarrollo de interfaces de usuario basadas en Web. Es decir, JSF es un framework Web MVC que simplifica la construcci\u00f3n de interfaces de usuario (UI - User Interface) para aplicaciones basadas en el servidor, mediante el uso de componentes de interfaz de usuario reutilizables en una p\u00e1gina. PrimeFaces es una librer\u00eda de componentes para JSF de c\u00f3digo abierto, esta posee un conjunto de componentes enriquecidos y personalizados que facilitan el proceso de creaci\u00f3n de las aplicaciones Web. Posee alrededor de 100 componentes UI, se integra con el framework AJAX (tecnolog\u00eda para construir p\u00e1ginas Web din\u00e1micas del lado del cliente), es una librer\u00eda ligera y posee una extensa documentaci\u00f3n con ejemplos codificados.
aboutApplication_tab_jerseyWSNameWAF_title = Jersey Web Services 1.13
aboutApplication_outputText_jerseyWSDescriptionWAF_value = Jersey RESTful Web Service es un framework de c\u00f3digo abierto, es un framework especializado para desarrollar e implementar servicios web RESTful en aplicaciones basadas en Java, de manera que se proporciona soporte para las API\u2019s JAX-RS. Jersey permite entonces que los datos sean exportados en una variedad de formatos y abstraer sus detalles bajo una arquitectura cliente servidor. Este framework fue usado en el sistema para realizar la exposici\u00f3n de los servicios web hacia los dispositivos m\u00f3viles, gracias a que proporciona versiones regularmente con referencia de calidad, API\u2019s que pueden ser extendidas y es f\u00e1cil de usar al momento de implementar los servicios web y finalmente que puedan ser consumidos desde nuestros dispositivos m\u00f3viles.
aboutApplication_tab_openCVNameWAF_title = OpenCV 2.4.8
aboutApplication_outputText_openCVDescriptionWAF_value = Visi\u00f3n por Computadora de C\u00f3digo Abierto (<i>Open Source Computer Vision</i>) es una biblioteca de funciones de programaci\u00f3n dirigidas principalmente a la visi\u00f3n por computadora en tiempo real, desarrollado por el centro de investigaci\u00f3n <i>Intel</i> de Rusia en <i>Nizhny Novgorod</i>, y ahora con el apoyo de Willow Garaje y Itseez. Se ha elegido esta librer\u00eda para realizar todo el proceso conocido como OMR (<i>Optical Mark Recognition</i>) debido a que es una de las pocas librer\u00eda de c\u00f3digo abierto orientadas a la visi\u00f3n por computador, adem\u00e1s de ser multiplataforma y a que finalmente posee m\u00e9todos para la optimizaci\u00f3n de los procesos de visi\u00f3n en tiempo real.
aboutApplication_outputText_introductionAndroidApplication_value = A continuaci\u00f3n se listan las Tecnolog\u00edas y Frameworks importantes y fundamentales que ayudaron a construir las bases para la implementaci\u00f3n de la aplicaci\u00f3n m\u00f3vil Android.
aboutApplication_tab_eclipseADTNameAAT_title = Eclipse ADT (Android Developer Tools) 22.6.2
aboutApplication_outputText_eclipseADTDescriptionAAT_value = Android Developer Tools es un complemento para el IDE (<i>Entorno de Desarrollo Integrado</i>) Eclipse que extiende sus capacidades para que puedan configurarse r\u00e1pidamente proyectos Android, de esta manera crear una interfaz gr\u00e1fica para el usuario, agregar y eliminar componentes basados en la API de Android Framework, depurar aplicaciones usando el SDK de Android e incluso exportar aplicaciones en formato .apk para instalar. Se ha escogido este complemento debido a su sencillo uso, integraci\u00f3n e instalaci\u00f3n, adem\u00e1s de ser un componente libre.
aboutApplication_tab_javaJDKNameAAT_title = Java JDK 1.7.0_21
aboutApplication_outputText_javaJDKDescriptionAAT_value = Es un Software libre que provee herramientas de desarrollo para la creaci\u00f3n de diversos programas en el lenguaje de programaci\u00f3n Java. Entre los programas que este Software incluye se encuentran un visor de Applets, un compilador, un int\u00e9rprete y un generador de documentaci\u00f3n. Este Software fue usado como base para construir la aplicaci\u00f3n OMR Grader, lo que quiere decir que est\u00e1 basada en Java, el cual fue escogido gracias a su versatilidad, interoperabilidad y usabilidad.
aboutApplication_tab_androidNameAAT_title = Android 4.0 (API 14)
aboutApplication_outputText_androidDescriptionAAT_value = Es un sistema operativo m\u00f3vil desarrollado por google y basado en Linux, es una plataforma unificada tanto para los tel\u00e9fonos m\u00f3viles como para tabletas con grandes directrices sobre las interfaces gr\u00e1ficas, con navegadores web, agentes de contactos, componentes para reproductores de multimedia y complementos para las redes sociales. Este sistema operativo ha sido elegido para realizar todo el desarrollo de los dispositivos m\u00f3viles, de esta manera se puede garantizar una gran eficiencia, eficacia y la mejor experiencia de usuario que puede ofrecer este sistema operativo de c\u00f3digo abierto.
aboutApplication_tab_apacheHttpComponentsClientNameAAT_title = Apache HttpComponents Client 4.1.1
aboutApplication_outputText_apacheHttpComponentsClientDescriptionAAT_value = Es el proyecto responsable de crear y mantener un conjunto de  herramientas y componentes Java de bajo nivel, centrados en HTTP y los protocolos asociados. Este proyecto se encuentra bajo la direcci\u00f3n de Apache Software Foundation, y es parte de una gran comunidad de desarrolladores y de usuarios en general. Aunque el paquete java.net proporciona la funcionalidad b\u00e1sica para acceder a los recursos a trav\u00e9s de HTTP, este no proporciona la flexibilidad total o la funcionalidad necesaria por muchas aplicaciones. Es por esto que se ha elegido Apache HttpComponents, el cual busca llenar el vac\u00edo que deja java.net, proporcionando un paquete eficiente hasta la fecha.

# aboutProject.xhtml
aboutProject_tab_objectives_title = Objetivos
aboutProject_outputText_objectivesIntroduction_value = En esta secci\u00f3n se describen el Objetivo General y sus Objetivos Espec\u00edficos, m\u00e1s detallados, que fueron abordados durante todo el ciclo de vida de este proyecto y los cuales se trataron de cumplir cabalmente y siempre guiaron el rumbo del proyecto en s\u00ed mismo.
aboutProject_overallObjectiveText = Objetivo General
aboutProject_outputText_overallObjectiveDescription_value = Efectuar la construcci\u00f3n plena de dos aplicativos heterog\u00e9neos, una aplicaci\u00f3n m\u00f3vil y otra basada en la Web, para ofrecerle a los profesores, instructores o personas interesadas, una herramienta automatizada para efectuar una calificaci\u00f3n r\u00e1pida y segura de ex\u00e1menes de selecci\u00f3n m\u00faltiple; donde la aplicaci\u00f3n m\u00f3vil servir\u00e1 como puente de comunicaci\u00f3n con la aplicaci\u00f3n Web, ya que gracias a esta se podr\u00e1 capturar toda la informaci\u00f3n necesaria para generar la calificaci\u00f3n autom\u00e1tica en el aplicativo Web.
aboutProject_specificObjectivesText = Objetivos Espec\u00edficos
aboutProject_outputText_specificObjective1_value = Construir una aplicaci\u00f3n Web, capaz de ofrecer los servicios necesarios para llevar a cabo un procesamiento completo de las im\u00e1genes que representen los diversos ex\u00e1menes que se desean evaluar autom\u00e1ticamente.
aboutProject_outputText_specificObjective2_value = Construir una aplicaci\u00f3n nativa Android, capaz de capturar toda la informaci\u00f3n requerida para realizar la calificaci\u00f3n autom\u00e1tica de los ex\u00e1menes de selecci\u00f3n m\u00faltiple, y efectuar una comunicaci\u00f3n eficiente con la aplicaci\u00f3n Web.
aboutProject_outputText_specificObjective3_value = Utilizar la tecnolog\u00eda de Servicios Web, tanto para enviar la informaci\u00f3n requerida como para recibir los resultados y respuestas necesarias para generar una comunicaci\u00f3n estable entre el aplicativo Android y el aplicativo Web.
aboutProject_outputText_specificObjective4_value = Realizar una implementaci\u00f3n completa basada en an\u00e1lisis y procesamiento digital de im\u00e1genes, utilizando la herramienta y las funciones contenidas en la librer\u00eda llamada OpenCV (<i>Open Computer Vision</i>).
aboutProject_outputText_specificObjective5_value = Presentar los resultados de las notas obtenidas en los ex\u00e1menes de selecci\u00f3n m\u00faltiple de una forma tabulada en una hoja de c\u00e1lculo, y enviarla a un direcci\u00f3n de correo electr\u00f3nico suministrada por un usuario desde la aplicaci\u00f3n Android.
aboutProject_outputText_specificObjective6_value = Definir un mecanismo \u00fanico y capaz de facilitar la identificaci\u00f3n correcta y acertada del estudiante que ha realizado cierto examen de selecci\u00f3n m\u00faltiple, el cual se presente calificar autom\u00e1ticamente por medio del uso de las aplicaciones.
aboutProject_outputText_specificObjective7_value = Realizar una implementaci\u00f3n multihilo (<i>multithreaded</i>) para soportar los diversos procesos de calificaci\u00f3n autom\u00e1tica y reporte de resultados en la aplicaci\u00f3n Web, con la finalidad de soportar alta concurrencia y mejorar el rendimiento de la aplicaci\u00f3n aprovechando el uso del procesador del servidor.
aboutProject_tab_applicationDescription_title = Descripci\u00f3n de la Aplicaci\u00f3n
aboutProject_outputText_introductionApplicationDescription_value = En esta secci\u00f3n se describen brevemente las finalidades y el objetivo principal que se le ha asignado a cada una de las aplicaciones que fueron construidas para la realizaci\u00f3n de este proyecto. En caso de requerir informaci\u00f3n sobre uso o manuales de referencia, es recomendable acudir a la secci\u00f3n construida para este prop\u00f3sito como tal.
aboutProject_outputText_webApplicationDescription_value = El objetivo que justifica la construcci\u00f3n de esta aplicaci\u00f3n Web radica en la definici\u00f3n del alcance y los requerimientos del proyecto mismo, ya que la gran capacidad de procesamiento y dem\u00e1s recursos de sistema que puede ofrecer una gran computadora como un Servidor de Aplicaciones ofrece un punto fuerte para la ejecuci\u00f3n satisfactoria y correcta de todos los procesos de negocio creados para el desarrollo de este proyecto.<br /><br />Por otro lado, al tener la aplicaci\u00f3n centralizada en una arquitectura de Cliente-Servidor (Client-Server), se podr\u00e1 garantizar en gran medida alta concurrencia entre los usuarios y evitar problemas de versiones de la aplicaci\u00f3n; similarmente, se facilita el mantenimiento y la disponibilidad en gran parte. Se podr\u00eda llegar a pensar en realizar o implementar todos los procesos de negocio sobre la misma aplicaci\u00f3n m\u00f3vil, pero la falta de recursos y el poco procesamiento tanto l\u00f3gico como gr\u00e1fico que ofrecen los dispositivos m\u00f3viles hoy en d\u00eda, afectar\u00edan directamente el desempe\u00f1o y rendimiento de la aplicaci\u00f3n, afectando sin lugar a dudas la usabilidad de la aplicaci\u00f3n en s\u00ed misma.<br /><br />Justific\u00e1ndose en lo anterior, entonces, la aplicaci\u00f3n Web posee la funci\u00f3n de recibir los par\u00e1metros o valores que definen la sesi\u00f3n de ex\u00e1menes a calificar autom\u00e1ticamente y que han sido recolectados a trav\u00e9s de la aplicaci\u00f3n m\u00f3vil; ya con toda esta informaci\u00f3n disponible y luego de ser validada en gran medida, los procesos de negocio comenzar\u00e1n a ejecutar el an\u00e1lisis y procesamiento digital de las im\u00e1genes que representan los ex\u00e1menes de selecci\u00f3n m\u00faltiple a ser evaluados, y posteriormente, la generaci\u00f3n y env\u00edo de reportes de los resultados asociados a cada uno de los ex\u00e1menes procesados. En otras palabras, la aplicaci\u00f3n Web contiene la l\u00f3gica o n\u00facleo principal que resuelve el problema planteado en este proyecto.
aboutProject_outputText_androidApplicationDescription_value = El objetivo que justifica la construcci\u00f3n de esta aplicaci\u00f3n m\u00f3vil bajo la plataforma Android radica en la definici\u00f3n del alcance y los requerimientos del proyecto mismo, ya que la idea bajo la cual se concibi\u00f3 el proyecto era en ofrecer una aplicaci\u00f3n libre y accesible a todas aquellas personas que requer\u00edan y desean automatizar sus procesos de calificaci\u00f3n de ex\u00e1menes de selecci\u00f3n m\u00faltiple bajo el est\u00e1ndar o uso de una plantilla base.<br /><br />Gracias a esta aplicaci\u00f3n m\u00f3vil Android, todas las personas podr\u00e1n acceder de una forma libre y sin problemas de versiones y distribuciones a la aplicaci\u00f3n Web para calificar autom\u00e1ticamente sus ex\u00e1menes de selecci\u00f3n m\u00faltiple realizados en sus cursos acad\u00e9micos. Adem\u00e1s, desde esta aplicaci\u00f3n m\u00f3vil se podr\u00e1 parametrizar algunos valores cr\u00edticos que afectan directamente la realizaci\u00f3n de la calificaci\u00f3n autom\u00e1tica, as\u00ed, algunos de estos valores son: nota m\u00e1xima a obtener, precisi\u00f3n decimal o m\u00ednimo porcentaje de respuestas buenas para aprobar el examen.<br /><br />Sin el uso de esta aplicaci\u00f3n m\u00f3vil Android no se podr\u00e1 acceder a los servicios y procesos construidos y definidos en este proyecto para realizar la calificaci\u00f3n autom\u00e1tica de los ex\u00e1menes, es decir, no existe ning\u00fan otro medio por el cual se pueda realizar una comunicaci\u00f3n segura y fiable entre alg\u00fan tipo de cliente en la red y el servidor de aplicaciones en el cual se ha desplegado el aplicativo Web que contiene toda la l\u00f3gica de negocio formulada para este proyecto.

# userDocumentation.xhtml
userDocumentation_headerTitle = Manual de Uso
userDocumentation_outputText_introductionUserDocumentation_value = En esta secci\u00f3n se podr\u00e1 descargar un manual de usuario, en formato PDF, que detalla el paso a paso, como un manual de instrucciones o uso, las caracter\u00edsticas o funcionalidades que presentan cada una de las aplicaciones que han sido construidas durante este proyecto, adem\u00e1s, este se acompa\u00f1a de una serie de im\u00e1genes que detallan m\u00e1s gr\u00e1ficamente lo que se desea decir con texto.
userDocumentation_outputText_introductionWebApplicationDocumentation_value = A continuaci\u00f3n se puede visualizar el archivo en formato PDF que representa el manual de usuario que contiene las instrucciones de uso para la aplicaci\u00f3n Web.
userDocumentation_outputText_introductionAndroidApplicationDocumentation_value = A continuaci\u00f3n se puede visualizar el archivo en formato PDF que representa el manual de usuario que contiene las instrucciones de uso para la aplicaci\u00f3n m\u00f3vil Android.
userDocumentation_userDocumentationPath = ./resources/docs/userdocumentation/
userDocumentation_webApplicationDocumentationPDFName = USER_DOCUMENTATION_WEB_APPLICATION.pdf
userDocumentation_androidApplicationDocumentationPDFName = USER_DOCUMENTATION_ANDROID_APPLICATION.pdf
userDocumentation_browserDoesNotDisplayPDFText = Su navegador no puede mostrar el PDF,
userDocumentation_clicText = clic
userDocumentation_forDownloadingText = para descargarlo.

# examTemplate.xhtml
examTemplate_headerTitle = Plantilla de Evaluaci\u00f3n
examTemplate_outputText_introduction_value = En esta secci\u00f3n se podr\u00e1 descargar el formato tanto en PDF (Portable Document Format) o en documento de texto compatible DOCX, creado con Microsoft Office Word 2013, la plantilla \u00fanica, est\u00e1ndar y generada para la construcci\u00f3n de los ex\u00e1menes a ser calificados por medio de las aplicaciones desarrolladas en este proyecto.
examTemplate_commandButton_downloadDOCXFileTemplate_value = Descargar DOCX
examTemplate_commandButton_downloadPDFFileTemplate_value = Descargar PDF

# acknowledgements.xhtml
acknowledgements_headerTitle = Agradecimientos